__author__ = 'Мишин Егор Олегович'

'''
Пользователь вводит номер буквы в алфавите. Определить, какая это буква.
'''

ans = int(input('введите номер буквы в алфавите(от 1 до 26)'))
print(chr(ans+96))
